<div class="grid gap-2 min-h-svh overflow-clip h-full bg-[#FFF2DC] px-4 xs:px-1 ">

    @switch($page)
        @case(1)
            <div style="background: url({{ asset('img/Q0-1.jpg') }}) center bottom; background-size:contain; background-repeat: no-repeat;"
                class="relative">
                <img src="{{asset('img/logo.png')}}" class="absolute top-2 right-2 w-10"/>
                <h1 class="text-center text-3xl pt-24">คุณเป็น <b>‘คนช่างเลือก’</b> <br>แบบไหน ?</h1>
                {{-- <x-button label="next" :href="route('ClientProfile')"/> --}}
                <div class="absolute bottom-28 w-full text-center">
                    <x-button flat rounded class="!bg-gradient-to-b from-primary-100 to-primary-200 !p-1 
                    hover:from-primary-300 hover:to-primary-400 w-60" 
                        wire:click="nextPage">
                        <div class="bg-gradient-to-b from-primary-200 to-primary-100 
                        hover:from-primary-400 hover:to-primary-300 w-full h-full rounded-full py-3 px-5 
                        text-white text-2xl">
                            คลิก
                        </div>
                    </x-button>
                </div>
            </div>
        @break

        @case(2)
            <div class="relative">
                <h1 class="text-center text-2xl pt-24">หนังสือให้ความยินยอมสำหรับลูกค้า<br>
                    (Customer Consent Form)</h1>
                <div class="p-6 pt-8 aspect-[3/4] w-11/12 m-auto flex-grow max-h-[65vh]"
                    style="background: url({{ asset('img/frame.png') }}) center top; 
                background-size:contain; background-repeat: no-repeat;">
                    <div class="p-2 mx-2 overflow-y-scroll h-[90%] text-xs ">
                        <p>บริษัท ครีเอเทกซ์ เฮาส์ จำกัด (“ครีเอเทกซ์ เฮาส์ ”) เห็นความสำคัญในการคุ้มครองข้อมูลส่วนบุคคลของท่าน
                            ตามที่กำหนดไว้ใน
                            พระราชบัญญัติคุ้มครองข้อมูลส่วนบุคคลพ.ศ. 2562 ครีเอเทกซ์ เฮาส์
                            จึงได้จัดทำหนังสือให้ความยินยอมในการเก็บรวบรวม ใช้
                            และ/หรือเปิดเผยข้อมูล ส่วนบุคคลของท่านในฐานะลูกค้า ผู้ใช้สินค้า หรือผู้รับบริการของครีเอเทกซ์ เฮาส์
                            เพื่อขอความยินยอมจาก
                            ท่านภายใต้ขอบเขตวัตถุประสงค์ที่จะกล่าวถึงต่อไปนี้
                        <ol>
                            <li>1.คำนิยาม
                                “ข้อมูลส่วนบุคคล”ภายใต้หนังสือให้ความยินยอมฉบับนี้ หมายถึง
                                ข้อมูลใดๆที่เกี่ยวกับบุคคลที่ทำให้สามารถระบุตัวตนบุคคลนั้น
                                ได้ไม่ว่าทางตรงหรือทางอ้อมรวมทั้งข้อมูลทุกประเภทที่สามารถบ่งชี้ตัวตน ซึ่งรวมถึงแต่ไม่จำกัดเพียง
                                ชื่อ หมายเลขประจำตัว
                                บัตรประชาชน ข้อมูลสถานที่อยู่ ข้อมูลออนไลน์ ข้อมูลเอกลักษณ์ทางกายภาพทางจิตใจ ทางสังคม เศรษฐกิจ
                                วัฒนธรรม หรือ
                                ข้อมูลอื่นใด ที่สามารถระบุตัวตนได้
                            </li>
                            <li>2.ข้อมูลที่เก็บรวบรวมและประมวลผล
                                เมื่อท่านลงทะเบียนใช้บริการ ครีเอเทกซ์ เฮาส์ จำเป็นต้องเก็บรวบรวม ใช้
                                และ/หรือเปิดเผยข้อมูลส่วนบุคคลของท่าน ซึ่งรวมถึง
                                แต่ไม่จำกัดเพียง
                                <ul>
                                    <li>• ชื่อเล่น หรือชื่อที่ใช้ในการเล่นเกม
                                    </li>
                                    <li>• อายุ
                                    </li>
                                </ul>
                            </li>
                            <li>3.วัตถุประสงค์และเหตุผลทางกฎหมายในการเก็บรวบรวม ใช้ และเปิดเผยข้อมูลของท่าน
                                ครีเอเทกซ์ เฮาส์ เก็บรวบรวม ใช้ และเปิดเผยข้อมูลส่วนบุคคลเพื่อวัตถุประสงค์ดังต่อไปนี้
                                <ul>
                                    <li>• เพื่อจัดการ ดูแลการใช้งาน หรือเข้าถึงบริการเว็บไซต์และเกมของครีเอเทกซ์ เฮาส์
                                        พร้อมทั้งปรับปรุงประสบการณ์ที่ท่านได้รับ
                                        จากการใช้งานบริการของครีเอเทกซ์ เฮาส์
                                    </li>
                                    <li>• เพื่อใช้ในการระบุและยืนยันตัวตน
                                    </li>
                                    <li>• เพื่อบังคับใช้ข้อตกลงการให้บริการ รวมถึงกฎกติกาการเล่นเกมต่างๆ ของครีเอเทกซ์ เฮาส์
                                    </li>
                                    <li>• เพื่อทำการศึกษา วิเคราะห์ และพัฒนากิจกรรมต่างๆ
                                        เพื่อนำไปใช้พัฒนาและปรับปรุงผลิตภัณฑ์และการบริการของครีเอเทกซ์ เฮา
                                        ส์ และบริษัทผู้ว่าจ้างครีเอเทกซ์ เฮาส์ ในการจัดกิจกรรมต่างๆ
                                    </li>
                                    <li>• เพื่อจัดทำสื่อประชาสัมพันธ์ผลิตภัณฑ์ การบริการ กิจกรรม โปรโมชั่น หรือการดำเนินการใดๆ
                                        เพื่อวัตถุประสงค์ในการส่งเสริม
                                        การขายของบริษัทผู้ว่าจ้างครีเอเทกซ์ เฮาส์
                                    </li>
                                </ul>
                            </li>
                            <li>4.สิทธิของท่าน
                                ท่านมีสิทธิดังต่อไปนี้เกี่ยวกับข้อมูลส่วนบุคคลของท่าน
                                <ul>
                                    <li>•
                                        สิทธิในการเข้าถึงข้อมูลส่วนบุคคลของท่านรวมทั้งสิทธิในการขอให้แก้ไขข้อมูลที่ไม่ถูกต้องหรือไม่ครบถ้วน
                                    </li>
                                    <li>• สิทธิในการขอสำเนาข้อมูลส่วนบุคคลในรูปแบบอิเล็กทรอนิกส์ที่ท่านอาจส่งให้บุคคลภายนอก
                                    </li>
                                    <li>•
                                        สิทธิที่จะคัดค้านการประมวลผลข้อมูลส่วนบุคคลของท่านเพื่อวัตถุประสงค์ทางการตลาดและวัตถุประสงค์อื่นใด
                                    </li>
                                    <li>• สิทธิที่จะขอให้ลบข้อมูลส่วนบุคคลของท่านเมื่อไม่มีความจำเป็น
                                        สำหรับวัตถุประสงค์ที่มีการจัดเก็บ รวมทั้งสิทธิที่จะจำกัด
                                        ขอบเขตการประมวลผลข้อมูลส่วนบุคคล ในกรณีที่ไม่สามารถให้ลบได้
                                    </li>
                                    <li>• สิทธิขอให้ผู้ควบคุมข้อมูลส่วนบุคคลระงับการใช้ข้อมูลส่วนบุคคลได้
                                    </li>
                                    <li>• สิทธิร้องขอให้บริษัทดำเนินการให้ข้อมูลส่วนบุคคลนั้นถูกต้อง เป็นปัจจุบัน สมบูรณ์
                                        และไม่ก่อให้เกิดความเข้าใจผิด
                                    </li>
                                    <li>• สิทธิที่จะร้องเรียนกับหน่วยงานที่ควบคุมในกรณีที่ท่านเชื่อว่ามีการละเมิดสิทธิท่าน
                                    </li>
                                </ul>
                            </li>
                            <li>5.ระยะเวลาในการเก็บข้อมูลและเจ้าหน้าที่คุ้มครองข้อมูลส่วนบุคคล
                                ครีเอเทกซ์ เฮาส์ จะเก็บข้อมูลของท่านไว้ไม่เกิน 60 วัน นับตั้งแต่วันที่ท่านได้นำข้อมูลเข้าสู่ระบบ
                                หากมีคำถาม หรือต้องการดำเนิน
                                การตามข้อ 4. สามารถติดต่อ info@createxhouse.com
                            </li>
                        </ol>
                        ข้าพเจ้าขอรับรองและยืนยันว่า ข้าพเจ้าได้อ่าน เข้าใจ
                        และทราบถึงรายละเอียดของหนังสือให้ความยินยอมที่ได้อธิบายไปข้างต้น
                        ซึ่งอธิบายวิธีการ เก็บรวบรวม ใช้ หรือเปิดเผยข้อมูลส่วนบุคคลของข้าพเจ้าแล้ว และยินยอมให้ครีเอเทกซ์ เฮาส์
                        เก็บรวบรวม ใช้
                        และ/หรือเปิดเผยข้อมูลส่วนบุคคล ได้แก่ ชื่อ นามสกุล เป็นต้น และ/หรือยินยอมให้ให้ครีเอเทกซ์ เฮาส์
                        เปิดเผยข้อมูลดังกล่าวแก่
                        บริษัทผู้ว่าจ้าง เพื่อการวิเคราะห์เพื่อการพัฒนาผลิตภัณฑ์หรือบริการ
                        การดำเนินกิจกรรมทางการตลาดเพื่อการสื่อสารด้านการ
                        ตลาด ข้อมูลข่าวสาร ข้อเสนอพิเศษ และสิทธิ ประโยชน์เกี่ยวกับผลิตภัณฑ์และบริการของบริษัทผู้ว่าจ้าง</p>
                    </div>
                </div>
                <div class="absolute bottom-10 w-full text-center grid grid-cols-2 gap-2">
                    <x-button flat rounded class="!bg-gradient-to-b from-primary-100 to-primary-200 !p-1 
                    hover:from-primary-300 hover:to-primary-400 " 
                    href="{{ route('ClientProfile') }}">
                        <div class="bg-gradient-to-b from-primary-200 to-primary-100 
                        hover:from-primary-400 hover:to-primary-300 w-full h-full rounded-full py-3 px-5 
                        text-white text-2xl">
                        ยินยอม
                        </div>
                    </x-button>
                    <x-button flat rounded class="!bg-gradient-to-b from-primary-100 to-primary-200 !p-1 
                    hover:from-primary-300 hover:to-primary-400 " 
                    href="{{ route('home') }}">
                        <div class="bg-gradient-to-b from-primary-200 to-primary-100 
                        hover:from-primary-400 hover:to-primary-300 w-full h-full rounded-full py-3 px-5 
                        text-white text-2xl">
                        ไม่ยินยอม
                        </div>
                    </x-button>

                </div>
            </div>
        @break

        @default
    @endswitch
    {{-- Nothing in the world is as soft and yielding as water. --}}
</div>
